In [10]:
import pandas as pd

df1 = pd.DataFrame({'날짜': [27, 28], '값': [0.2, 0.1]})
df2 = pd.DataFrame({'날짜': [25, 27, 28]})

In [11]:
df1

   날짜    값
0  27  0.2
1  28  0.1

In [12]:
df2

   날짜
0  25
1  27
2  28

In [13]:
merged_df

   날짜    값
0  25  NaN
1  27  0.2
2  28  0.1

In [14]:
df1.merge(df2)

   날짜    값
0  27  0.2
1  28  0.1

In [15]:
df2.merge(df1)

   날짜    값
0  27  0.2
1  28  0.1

In [16]:
df1.merge(df2,how='right')

   날짜    값
0  25  NaN
1  27  0.2
2  28  0.1

In [17]:
df2.merge(df1,how='left')

   날짜    값
0  25  NaN
1  27  0.2
2  28  0.1